#include <iostream>

// [2024-08-16]
// 제목 : LV9

// Data Swap 
// 두개의 변수를 교체하는 것을 SWAP

// 구조체 struct
// 데이터의 묶음 이라고 한다.
// 새로운 변수또는 배열을 계속적으로 추가하는 단점을 보완해준다.
// 내가 알기로는 class도 존재하지만 일단은 먼저 구조체

// Counting 응용 
// 1번 예제에서는 특정한 데이터를 세는 부분으로 사용 
// 2번 1번과 마찬가지의 이유이긴 하지만 대충 저 응용해서 특정 진입점으로 아용하는데 그냥 별차이가 없어보임 내 기준에서는 

// 함수 전달 인자 (Call By Value)
// 함수에 값을 전달할 때, 원본 변수가 아닌 그 값이 복사되어 전달된다.
// 이렇게 전달되는 방식을 Call by Value라고 한다.
// 즉, 함수 안에서 사용되는 변수는 원본과는 별개로 동작한다.

int main()
{
	std::cout << "Hello, World!" << std::endl;

	return 0;
}